Create heading, emote, image, bullet point
# Heading 1 üßë‚Äçüéì
## Heading 2 üêä
### Heading 3 
#### Heading 4

- 1
- 2

<img src = 'https://i0.wp.com/www.printmag.com/wp-content/uploads/2021/02/4cbe8d_f1ed2800a49649848102c68fc5a66e53mv2.gif?resize=476%2C280&ssl=1'>

Create

In [3]:
import numpy as np
import pandas as pd

# Create series with pandas üëç

**Using list**

In [4]:
data = [1,2,3,4]
idx = ['atang1','atang2','atang3','atang4']
atang_series = pd.Series(data, idx)
atang_series

atang1    1
atang2    2
atang3    3
atang4    4
dtype: int64

In [5]:
atang_series['atang4']

4

# Create series with numpy array

In [6]:
arr = np.arange(1,10,2)
series = pd.Series(arr)
series

0    1
1    3
2    5
3    7
4    9
dtype: int64

# Create series with dictionary üíØ

In [7]:
d = {'a':10, 'b':11, 'c':12}
pd.Series(d)

a    10
b    11
c    12
dtype: int64

# Create DataFrame

**from list**

In [13]:
a = [i for i in range(1,5)]
b = [i for i in range(5,9)]
c = [i for i in range(9,13)]

In [15]:
data = pd.DataFrame([a,b,c],
                    columns= 'a b c d'.split(),
                    index= 'x y z'.split()
                    )
data

   a   b   c   d
x  1   2   3   4
y  5   6   7   8
z  9  10  11  12

**from array**

In [16]:
pd.DataFrame(np.arange(1,26).reshape(5,5),
             columns= 'a b c d e'.split())

    a   b   c   d   e
0   1   2   3   4   5
1   6   7   8   9  10
2  11  12  13  14  15
3  16  17  18  19  20
4  21  22  23  24  25

**from dictionary**

In [18]:
student = pd.DataFrame({
    'no' : [1,2,3],
    'name' : ['atang', 'cecep', 'saipul'],
    'sex' : ['male', 'female', 'male'],
    'age' : [18,19,14],
    'tanggal lahir' : [28,32,1]
})
student

   no    name     sex  age  tanggal lahir
0   1   atang    male   18             28
1   2   cecep  female   19             32
2   3  saipul    male   14              1

# Slicing and Indexing
## to access column

In [20]:
student['tanggal lahir'][1:]

1    32
2     1
Name: tanggal lahir, dtype: int64

In [23]:
student['jurusan'] = ['ipa','ips','bahasa']
student

   no    name     sex  age  tanggal lahir jurusan
0   1   atang    male   18             28     ipa
1   2   cecep  female   19             32     ips
2   3  saipul    male   14              1  bahasa

In [24]:
student [['name','sex','jurusan']]

     name     sex jurusan
0   atang    male     ipa
1   cecep  female     ips
2  saipul    male  bahasa

# Slicing Indexing with loc and iloc
## to access row

In [28]:
student.loc[1]

no                    2
name              cecep
sex              female
age                  19
tanggal lahir        32
jurusan             ips
Name: 1, dtype: object

In [29]:
student.iloc[1]

no                    2
name              cecep
sex              female
age                  19
tanggal lahir        32
jurusan             ips
Name: 1, dtype: object

# Conditional Selectioin

In [30]:
student

   no    name     sex  age  tanggal lahir jurusan
0   1   atang    male   18             28     ipa
1   2   cecep  female   19             32     ips
2   3  saipul    male   14              1  bahasa

In [31]:
student[student['age'] > 17]

   no   name     sex  age  tanggal lahir jurusan
0   1  atang    male   18             28     ipa
1   2  cecep  female   19             32     ips

In [40]:
ktp_male = student[(student['sex'] == 'male') & (student['age'] > 17)][['name','age']]
ktp_male

    name  age
0  atang   18